//*****************************************************************************
//!	@file	MathUtil.h
//!	@brief	数学系の関数
//!	@note	
//!	@author	
//*****************************************************************************
#ifndef _MATHUTIL_H
#define _MATHUTIL_H
#pragma once

//-----------------------------------------------------------------------------
//	Include header files.
//-----------------------------------------------------------------------------
#include <d3dx9.h>

//-----------------------------------------------------------------------------
//	プロトタイプ宣言
//-----------------------------------------------------------------------------
void MakeWorldMatrix(D3DXMATRIX& mat, const D3DXVECTOR3& trans, const D3DXVECTOR3& angle, const D3DXVECTOR3& scale);
void MakeWorldMatrix(D3DXMATRIX& mat, D3DXMATRIX& mattotal, const D3DXVECTOR3& trans, const D3DXVECTOR3& angle, const D3DXVECTOR3& scale);

//*****************************************************************************
//	End of file.
//*****************************************************************************
#endif