//*****************************************************************************
//!	@file	Task.h
//!	@brief	タスククラス。何かのモジュールはすべてこのTaskクラスを継承する。
//!	@note	2018/07/25
//!	@author
//*****************************************************************************
#pragma once
#ifndef _TASK_H_
#define _TASK_H_

//-----------------------------------------------------------------------------
//	Include header files.
//-----------------------------------------------------------------------------
#include "GameUtil.h"

class Task {
public:
	Task() {}
	virtual ~Task() {}
	virtual void Initialize(LPDIRECT3DDEVICE9 lpdev) {}        //初期化処理は実装してもしなくてもいい
	virtual void Finalize() {}        //終了処理は実装してもしなくてもいい
	virtual void Update(LPDIRECT3DDEVICE9 lpdev) = 0;    //更新処理は必ず継承先で実装する
	virtual void Draw(LPDIRECT3DDEVICE9 lpdev) = 0;    //描画処理は必ず継承先で実装する
};
//*****************************************************************************
//	End of file.
//*****************************************************************************
#endif